Revit 2024 API
ExportPatternTable.Clear Method
 Removes all contents stored in the table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void Clear()
Visual Basic
Public Sub Clear
Visual C++
public:
void Clear()
See Also
ExportPatternTable Class
Autodesk.Revit.DB Namespace